-- Active: 1679903602153@@127.0.0.1@3306@ff14
-- 设置客户端连接服务器端编码
set names utf8;
-- 丢弃数据库如果存在
drop database if exists ff14;
-- 创建新的数据库
create database ff14 charset = utf8;
-- 进入数据库
use ff14;
-- 新闻分类表
create table ff14_versionFocus(
    fid int primary key auto_increment,
    fname varchar(16) unique
);
-- 插入数据
insert into ff14_versionFocus
values (100, '天上欢庆，地下轰鸣'),
    (200, '禁忌的记忆'),
    (300, '崭新的冒险'),
    (400, '晓月之终途');
CREATE TABLE ff14_versionContent(
    cid int primary key auto_increment,
    事先准备 VARCHAR (255),
    四人副本 VARCHAR (255),
    蛮神副本 VARCHAR (255),
    ２４人本 VARCHAR (255),
    大型副本 VARCHAR (255),
    高难副本 VARCHAR (255),
    生产采集 VARCHAR (255),
    深层迷宫 VARCHAR (255),
    后续内容 VARCHAR (255),
    其他内容 VARCHAR (255),
    ff_id VARCHAR (255) -- foreign key(ff_id) references ff14_versionFocus(fid)
);
-- 插入数据
INSERT INTO ff14_versionContent (ff_id, 事先准备, 四人副本, 蛮神副本, 生产采集, 后续内容, 其他内容)
VALUES (
        400,
        '[6.0] 战斗职业事先准备,[6.0] 生产采集事先准备',
        '[81] 异形楼阁 佐特塔,
[83] 魔导神门 巴别塔,
[85] 末日树海 万相森国,
[87] 创造环境 极北造物院,
[89] 星海深幽 寻因星晶镜,
[90] 最终幻想 末世终迹,
[90] 电脑梦境 斯提格玛四,
[90] 乐园都市 笑笑镇',
        '
[83] 佐迪亚克歼灭战，
[89] 海德林歼灭战，
[90] 终结之战，
[90] 佐迪亚克暝暗歼灭战，
[90] 海德林晖光歼灭战',
        '[90] Lv80-90生产练级宏,
[90] 生产采集6.0攻略及提前准备，
[90] 顶配禁断宏搓伊修加德/辉煌，
[90] 580HQ推荐手法
',
        ' 
[90] 子言姐姐-万魔殿普通1-4层,
[90] 子言姐姐-万魔殿零式一层，
[90] 魔法少女-万魔殿零式一层，
[90] 被窝国际-万魔殿零式一层，
[90] 友利郁也-万魔殿零式一层，
[90] 被窝国际-万魔殿零式二层，
-,
[90] Delta-万魔殿零式三层，
[90] 被窝国际-万魔殿零式三层，
[90] 被窝国际-万魔殿零式四层-门神，
[90] 被窝国际-万魔殿零式四层-本体',
        '- [6.01]更新笔记,
- [6.0]更新笔记,
- 风脉/宠物/坐骑/狩猎/探索笔记'
    );
INSERT INTO ff14_versionContent (ff_id, 四人副本, 蛮神副本, ２４人本, 生产采集, 后续内容, 其他内容)
VALUES (
        300,
        '[90] 近东秘宝 阿尔扎达尔海底遗迹群',
        '
[90] 终极之战',
        '
[90] 灿烂神域 阿格莱亚',
        '[90] 专家不垫的590hq手法,
[90] 590HQ生产/采集装,
[90] 非专家不垫的590hq96%手法,
[90] 6.1版本顶配禁断宏秒杀辉煌',
        '[6.11] 绝龙诗-萌神神,
[6.11] 绝龙诗-咖波,
[6.11] 绝龙诗-莫古力攻略-P1-P4,
[6.11] 绝龙诗-魔法少女-P1-P4,
[6.11] 绝龙诗-子言姐姐-P5,
[6.11] 绝龙诗-友利郁也-P1-P7,
[6.11] 绝龙诗-候鸟症候群-P3+麻将全流程,
[6.11] 绝龙诗-模拟器,
[6.15] 次元欧米茄后日谈(暂译),
[6.15] 塔塔露的大繁荣商会(暂译),
[6.15] 回归的希尔迪布兰德（事件屋）(暂译),
[6.15] 老主顾阿梅莉安丝,
[6.15] 友好部族支线任务',
        '- [6.1]更新笔记,
- [鸡排]宠物/坐骑/乐谱,
- 联动复刻「牙狼」,
- 职能任务「帝都的野兽」,
- 幻巧战「究极神兵幻巧战」,
- 新增外墙配方「姜饼外墙」,
- 新增房区「穹顶皓天」，购买指南,
- 新增坐骑「辅助机602认证密钥」,金碟币购买,
- 新增硌狮族发型,
- 新增「探索笔记」达成时的演出'
    );
INSERT INTO ff14_versionContent (ff_id, 四人副本, 蛮神副本, 大型副本, 高难副本, 生产采集, 后续内容, 其他内容)
VALUES (
        200,
        '
[90] 异界孤城 特罗亚宫廷',
        '
[90] 巴尔巴莉希娅歼殛战',
        '
[90] 万魔殿 炼净之狱1~4',
        '2022/12/27开启,
-,
[子言] 零式-炼狱1,
[被窝] 零式-炼狱1,
[千星] 零式-炼狱2,
[被窝] 零式-炼狱2,
[被窝] 零式-炼狱3,
[苦茶子] 零式-炼狱3,
[啭啭] 零式-炼狱3,
-,
[菓子] 零式-炼狱4门神,
[苦茶子] 零式-炼狱4门神,
[胡萌萌] 零式-炼狱4本体,
[奶油咖啡] 零式-炼狱4本体',
        '[90] 610HQ,
[90] 610HQ最穷工匠の制作笔记,
[90] 獭獭泉生产高难配方不完全指北',
        '[6.25] 希拉狄哈水道-全结局文字,
[6.25] 希拉狄哈水道-全结局视频,
[6.25] 树歌-异闻希拉狄哈水道,
[6.25] mm+w-异闻希拉狄哈水道,
[6.25] 塔塔露的大繁荣商店,
[6.25] 回归的事件屋关联,
[6.25] 友好部族支线任务,
[6.25] 新强化武器关联',
        '- [6.2]更新笔记,
- [鸡排]数据更新至6.2,
- 新增[素素无人岛指南],
- 幻巧战「萨菲洛特幻巧战」,
- 崭新的冒险 番外篇,
- 追加「惊奇百宝城」掉落,
- 新增维埃拉族发型,
- 调整硌狮族发型,
- 新增「探索笔记」达成时的演出'
    );
INSERT INTO ff14_versionContent (
        ff_id,
        四人副本,
        蛮神副本,
        ２４人本,
        高难副本,
        生产采集,
        深层迷宫,
        后续内容,
        其他内容
    )
VALUES (
        100,
        '
[90] 雪山奥窟 冥魂石洞',
        '
[90] 树歌-极火天王/卢比坎特歼殛战,
[90] 菓子-幻女神索菲亚',
        '[90] 喜悦神域 欧芙洛绪涅',
        '视频攻略(2023/06/06开启),
-,
[莫古力][P1-2]欧米茄绝境战,
[莫古力]一图流打法,
[MM+W][P1]绝欧米茄检证战,
-,
[莫古力]P3先行版,
[狗贝戎]P3小电视,
[莫古力]P5先行版,
[模拟器]P5自制模拟器,
-,
-,
图文攻略,
-,
[素素] 绝欧米茄之绝密档案,
[MM+W] 绝欧米茄文档,
[贼喊捉贼] 绝欧米茄 自研攻略总结文档,
[盗火] Steal Fire绝欧米茄攻略',
        '[90] 生产&采集620HQ,
[90] 6.35-生产&采集肝武预览,
[90] 6.35-生产肝武系列攻略,
[90] 6.35-生产肝武莫雯工具简略+',
        '
正统优雷卡,
-,
[90] 苦茶子1-98层道具/怪物详细攻略,
-,
[90] 子言-BOSS战合集,
[90] GreatGBL-全BOSS战',
        '[6.35]副本-正统优雷卡,
[6.35]任务-回归的事件屋续篇,
[6.35]曼武-曼德维尔武器续篇,
[6.35]主手-生产采集莫雯工具,
[6.35]友好部族-兔兔族',
        '- [6.3]更新笔记,
-,
- [鸡排]数据更新至6.3,
- [无人岛指南]更新至6.3,
- [任务]虚无界的旁观者续篇,
- [任务]联系远东的大繁荣之轮,
- [任务]安登的老主顾,
- [挖宝]厄尔庇斯育体宝殿,
- [房屋]住宅区追加25~30区,
- [金碟]新增400w金碟币4人坐骑,
- [金碟]新增妖精领风格跳跳乐,
- [系统]队伍列表可显示buff剩余时'
    ) -- 创建新闻数据表
    -- create table ht_news(
    --     nid int primary key auto_increment,
    --     title varchar(64),
    --     ctime bigint,
    --     detail varchar(10240),
    --     cat_id int,
    --     -- 将cat_id列作为外键，它的值必须在ht_cat表的cid中出现过
    --     foreign key(cat_id) references ht_cat(cid)
    -- );
    -- -- 插入数据